app/views/messages/_message.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."group_id" = $1 ORDER BY "messages"."created_at" ASC  [["group_id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<div data-id="<%= message.user.id %>" class="message-outer-wrap">
	<span class="message-username <%= message.user == current_user(message.group) ? 'by-current-user' : 'message-guest' %>">