app/views/groups/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."group_id" = $1  [["group_id", 3]]
---
		</div>
		<% @group.users.each do |g| %>

SELECT "messages".* FROM "messages" WHERE "messages"."group_id" = $1 ORDER BY "messages"."created_at" ASC  [["group_id", 3]]
---
				<div id="messages" class="scrollable" data-group-id="<%= @group.id %>" data-user-id="<%= current_user(@group).id %>" data-group-access="<%= fetch_key(@group) %>">
				  <%= render @group.messages.order(:created_at) %>