app/channels/groups_channel.rb

INSERT INTO "messages" ("group_id", "user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["group_id", 4], ["user_id", 2], ["body", "test"], ["created_at", "2018-10-07 16:04:31.859204"], ["updated_at", "2018-10-07 16:04:31.859204"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def send_message(data)
    # process data sent from the page
    # iv = EncryptText.make_iv
    # key = data['group_access']
    # User.find(data['user_id']).messages.create!(
    #   tempkey: key,
    #   body: EncryptText.encrypt(data['message'], nil, iv),
    #   body: data['message'],
    #   group_id: data['group_id'],
    #   iv: iv
    # )
    User.find(data['user_id']).messages.create!(
      body: data['message'],
      group_id: data['group_id']
    )