app/helpers/application_helper.rb

  def current_user(group)
    if logged_in?(group)
      return User.find(session["group_#{group.id}_user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]