app/controllers/groups_controller.rb

  def create
    @group=Group.new(group_params)
    if @group.title.empty?
      @group.random_title
    end
    if @group.save
---
SELECT "groups"."title" FROM "groups"
SELECT  1 AS one FROM "groups" WHERE LOWER("groups"."title") = LOWER($1) LIMIT $2  [["title", "upper_cannon"], ["LIMIT", 1]]
INSERT INTO "groups" ("title", "slug", "expiration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "upper_cannon"], ["slug", "upper_cannon"], ["expiration", "2018-10-07 16:40:00.494119"], ["created_at", "2018-10-07 15:40:00.493963"], ["updated_at", "2018-10-07 15:40:00.493963"]]

  def show
    @group = Group.includes(:messages).find_by(slug: params[:slug])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."slug" = $1 LIMIT $2  [["slug", "summer_cypress"], ["LIMIT", 1]]

  def set_group
    if params[:group_slug]
      @group=Group.find_by(slug: params[:group_slug])
    else
      @group = Group.find_by(slug: params[:slug])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."slug" = $1 LIMIT $2  [["slug", "summer_cypress"], ["LIMIT", 1]]