app/controllers/users_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."slug" = $1 LIMIT $2  [["slug", "summer_cypress"], ["LIMIT", 1]]
SELECT "users"."username" FROM "users"
INSERT INTO "users" ("group_id", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 3], ["username", "expert_saint_ulmo"], ["created_at", "2018-10-07 15:49:33.741714"], ["updated_at", "2018-10-07 15:49:33.741714"]]
---
  def create
    @group=Group.find_by(slug: params[:group_slug])
    @user=User.new(user_params)
    if @user.username.empty?
      @user.random_name
    end
    @user.group = @group
    if @user.save