app/models/group.rb

  def random_title
    randtitle = RandomNouns.sample
    until !Group.pluck(:title).include? randtitle do
---
SELECT "groups"."title" FROM "groups"