app/models/user.rb

  def random_name
    randname = RandomAdjs.sample + "_" + RandomNouns.sample
    until !User.pluck(:username).include? randname do
---
SELECT "users"."username" FROM "users"