app/jobs/message_broadcast_job.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def perform(message)
    ActionCable.server.broadcast "groups_#{message.group.id}_channel",
      message: render_message(message)